In [1]:
# Panda is an open-source Python lybrary providing high-performance data manuplation

In [2]:
# Pandas data structure
# 1.Series => homogenious
# 2.DataFrame => Heterogeneous

In [1]:
import pandas as pd

Series

In [2]:
s = pd.Series([45,67,32,14,82])

In [3]:
s

0    45
1    67
2    32
3    14
4    82
dtype: int64

In [6]:
print(s)

0    45
1    67
2    32
3    14
4    82
dtype: int64

In [10]:
s.sort_values()

3    14
2    32
0    45
1    67
4    82
dtype: int64

In [9]:
s = pd.Series([45,67,32,14,82,32.12])

In [10]:
s

0    45.00
1    67.00
2    32.00
3    14.00
4    82.00
5    32.12
dtype: float64

In [11]:
s[3]

14.0

In [12]:
s[3] = 100

In [13]:
s

0     45.00
1     67.00
2     32.00
3    100.00
4     82.00
5     32.12
dtype: float64

In [15]:
s = pd.Series([45,67,32,14,82,'P'])

In [16]:
s

0    45
1    67
2    32
3    14
4    82
5     P
dtype: object

In [20]:
s = pd.Series([45,67,32,14,82,32.12],index = range(100,106))

In [21]:
s

100    45.00
101    67.00
102    32.00
103    14.00
104    82.00
105    32.12
dtype: float64

DataFrames

In [22]:
# dataframes are two dimensional

In [23]:
roll = pd.Series([1, 2, 3, 4, 5])
name = pd.Series(['Ajinkya','Amruta','Raj','Natasha','Neo'])
marks = pd.Series([76,73,81,85,88])

In [24]:
roll

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
name

0    Ajinkya
1     Amruta
2        Raj
3    Natasha
4        Neo
dtype: object

In [26]:
marks

0    76
1    73
2    81
3    85
4    88
dtype: int64

In [32]:
df = pd.DataFrame({
    'roll':roll,
    'name':name,
    'marks':marks
})

In [33]:
df

   roll     name  marks
0     1  Ajinkya     76
1     2   Amruta     73
2     3      Raj     81
3     4  Natasha     85
4     5      Neo     88

In [30]:
import os
os.getcwd()

'C:\\Users\\morep'

In [34]:
# laocation: https://mitu.co.in/dataset
# download all the files starting from student* and put them in same folder

###Import the data

In [35]:
df = pd.read_csv('student.csv')

In [36]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [37]:
df1 = pd.read_csv('student1.csv')

In [38]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [41]:
header = ['A','B','C','D','E']

In [43]:
df1 = pd.read_csv('student1.csv',names = header)
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [46]:
df2 = pd.read_csv('student3.tsv', sep ='\t')
df2

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [61]:
df3 = pd.read_csv(r"C:\Users\morep\student3.tsv", sep ='\t')

In [62]:
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [63]:
df.shape

(10, 5)

In [64]:
df.size

50

In [71]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [74]:
list(df.columns)

TypeError: 'Index' object is not callable

In [75]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [79]:
df.dtypes  # string shows object means their are collection of other data types

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [77]:
df.empty

False

In [78]:
df.values

array([[1, 'anil', 'TE', 56.77, 22],
       [2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [80]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [84]:
df.head()  # by default it shows top 5 values

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [86]:
df.head(2)

   roll  name class  marks  age
0     1  anil    TE  56.77   22
1     2  amit    TE  59.77   21

In [87]:
df.tail()    # by default it shows bottom 5 values

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [88]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [90]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [91]:
df.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [94]:
df.info()     # This will give you the all info about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

###DATA SLICING

In [96]:
df.iloc[3:6,0:3]  # in this

   roll     name class
3     4  ajinkya    TE
4     5     asha    TE
5     6   ayesha    BE

In [97]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [111]:
df.iloc[6:,1:4]

    name class  marks
6   amar    BE  65.34
7  amita    BE  68.33
8   amol    TE  56.75
9  anmol    BE  78.66

In [112]:
df.iloc[3:-1:1,2:-1:4]

  class
3    TE
4    TE
5    BE
6    BE
7    BE
8    TE

In [113]:
df.iloc[[4,6,8,9],[0,2,3]]

   roll class  marks
4     5    TE  63.28
6     7    BE  65.34
8     9    TE  56.75
9    10    BE  78.66

In [116]:
df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [117]:
df.iloc[:,2]

0    TE
1    TE
2    BE
3    TE
4    TE
5    BE
6    BE
7    BE
8    TE
9    BE
Name: class, dtype: object

In [119]:
df.iloc[5,1]

'ayesha'

In [120]:
df.loc[2:5,'name']

2     aniket
3    ajinkya
4       asha
5     ayesha
Name: name, dtype: object

In [127]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [128]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [130]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66